Docs/schema.md
```mermaid
erDiagram
	users ||--o{ workspaces : references
	users ||--|| workspace_members : references
	workspaces ||--o{ workspace_members : references
	workspaces ||--o{ tasks : references
	users ||--o{ tasks : references
	workspaces ||--o{ messages : references
	messages }o--|| users : references

	users {
		INTEGER user_id
		VARCHAR(255) email
		VARCHAR(255) hashed_pwd
		TIMESTAMP created_at
	}

	workspaces {
		INTEGER workspace_id
		INTEGER owner_id
		VARCHAR(255) name
		TIMESTAMP created_at
	}

	workspace_members {
		INTEGER workspace_member_id
		INTEGER user_id
		INTEGER workspace_id
		VARCHAR(255) role
		TIMESTAMP created_at
	}

	tasks {
		INTEGER task_id
		INTEGER workspace_id
		VARCHAR(255) title
		TEXT description
		VARCHAR(255) status
		INTEGER assigned_to
		TIMESTAMP due_date
		TIMESTAMP updated_at
		TIMESTAMP created_at
	}

	messages {
		INTEGER message_id
		INTEGER workspace_id
		INTEGER sender_id
		TEXT content
		TIMESTAMP created_at
	}
```
